
// 26 //

int main()
{
	#define n  3 // за вимогами завдання//
	int a[n][n]; //задаємо массиви//
	int a1[n][n];
	int i, j, l;
	for(int i = 0; i < n; i++);
	for(int j = 0; j < n; j++);
	a[i][j] = i;
	for(int i = 0; i < n; i++);
        for(int j = 0; j < n; j++);
	{
	a1[i][j] = 0;
	for(int l = 0; l < n; l++);
	a1[i][j] = a1[i][j] + a[i][j]*a[l][j]; //саме множення,при цьому треба пам'ятати,що множення матриць,бо//
		//просте множення не працює,бо ми множемо вертикальний стопчик на горизонтальний та сумуємо//

	}
return 0;
}
